Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&#xd;
xmlns:root=&quot;http://www.orange.com/BIE_EB/Interfaces/ManageProductInstalledRTMandCFU/v1/root&quot;&gt;&#xd;
&lt;soapenv:Header/&gt;&#xd;
&lt;soapenv:Body&gt;&#xd;
&lt;root:DebitUsageTransaction&gt;&#xd;
&lt;Local_RoutingKeys&gt;&#xd;
&lt;local_applicationCode&gt;SMSAPI&lt;/local_applicationCode&gt;&#xd;
&lt;local_mcoCode&gt;TUN&lt;/local_mcoCode&gt;&#xd;
&lt;local_userType&gt;M&lt;/local_userType&gt;&#xd;
&lt;local_usage&gt;Mobile&lt;/local_usage&gt;&#xd;
&lt;/Local_RoutingKeys&gt;&#xd;
&lt;DebitTransaction&gt;&#xd;
&lt;InstalledUsageProduct&gt;&#xd;
&lt;InstalledPublicKey&gt;&#xd;
&lt;functionValue&gt;+21658525362&lt;/functionValue&gt;&#xd;
&lt;FunctionSpecification&gt;&#xd;
&lt;functionSpecificationLabel&gt;MSISDN&lt;/functionSpecificationLabel&gt;&#xd;
&lt;/FunctionSpecification&gt;&#xd;
&lt;/InstalledPublicKey&gt;&#xd;
&lt;InstalledFunctionValue&gt;&#xd;
&lt;functionValue&gt;CORR1238&lt;/functionValue&gt;&#xd;
&lt;FunctionSpecification&gt;&#xd;
&lt;functionSpecificationLabel&gt;PartnerTransactionID&lt;/functionSpecificationLabel&gt;&#xd;
&lt;/FunctionSpecification&gt;&#xd;
&lt;/InstalledFunctionValue&gt;&#xd;
&lt;InstalledFunctionValue&gt;&#xd;
&lt;functionValue&gt;optional_publisher_name&lt;/functionValue&gt;&#xd;
&lt;FunctionSpecification&gt;&#xd;
&lt;functionSpecificationLabel&gt;MerchantDescription&lt;/functionSpecificationLabel&gt;&#xd;
&lt;/FunctionSpecification&gt;&#xd;
&lt;/InstalledFunctionValue&gt;&#xd;
&lt;/InstalledUsageProduct&gt;&#xd;
&lt;Currency&gt;&#xd;
&lt;currencyCode&gt;TND&lt;/currencyCode&gt;&#xd;
&lt;/Currency&gt;&#xd;
&lt;ProductSpecification&gt;&#xd;
&lt;productSpecificationCode&gt;SMSAPI&lt;/productSpecificationCode&gt;&#xd;
&lt;productSpecificationLabel&gt;SMSAPI&lt;/productSpecificationLabel&gt;&#xd;
&lt;local_productSpecificationCategory&gt;optional_content_type&lt;/local_productSpecificationCategory&gt;&#xd;
&lt;/ProductSpecification&gt;&#xd;
&lt;RatingAmount&gt;&#xd;
&lt;taxIncludedRatingAmount&gt;1&lt;/taxIncludedRatingAmount&gt;&#xd;
&lt;taxRate&gt;20&lt;/taxRate&gt;&#xd;
&lt;/RatingAmount&gt;&#xd;
&lt;/DebitTransaction&gt;&#xd;
&lt;/root:DebitUsageTransaction&gt;&#xd;
&lt;/soapenv:Body&gt;&#xd;
&lt;/soapenv:Envelope&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.98.238.125</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/cim/services/managecim-1.0</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">10</stringProp>
          </ConstantTimer>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>